{
  "courses": [
    {
      "course_title": "Studio 1",
      "sms_code": "ID502001 / IA502001",
      "year": 1,
      "credits": 15,
      "prerequisites": [
        "None"
      ],
      "directed_learning_hours": 60,
      "workplace_learning_hours": 0,
      "self_directed_learning_hours": 90,
      "total_learning_hours": 150,
      "program": "Bachelor of Information Technology",
      "description": "This course introduces learners to the fundamentals of professionalism in a technical environment. By the end of the course, learners will be able to communicate appropriately in informal and semi-formal written and verbal contexts; discern functional and non-functional aspects within a problem domain in the context of data modelling; and use collaboration tools and workflows to contribute to a simple group project. Topics include problem domains, design thinking, introduction to databases, time management, report writing, oral presentations, version control (GitHub), and object-oriented concepts."
    },
    {
      "course_title": "Studio 2",
      "sms_code": "ID503001 / IA503001",
      "year": 1,
      "credits": 15,
      "prerequisites": [
        "ID502001 / IA502001"
      ],
      "directed_learning_hours": 60,
      "workplace_learning_hours": 0,
      "self_directed_learning_hours": 90,
      "total_learning_hours": 150,
      "program": "Bachelor of Information Technology",
      "description": "This course introduces learners to user-centric and technical project planning techniques to create solutions to simple IT problems. By the end of the course, learners will be able to employ sound communication to elicit user requirements to inform the planning process, and work as a member of a team to produce a simple technical output. Topics include basic iterative development, UML, basic project management skills and tools, design thinking, stand-up meetings, client interviews, and an introduction to user stories."
    },
    {
      "course_title": "Programming 1",
      "sms_code": "ID510001 / IA510001",
      "year": 1,
      "credits": 15,
      "prerequisites": [
        "None"
      ],
      "directed_learning_hours": 60,
      "workplace_learning_hours": 0,
      "self_directed_learning_hours": 90,
      "total_learning_hours": 150,
      "program": "Bachelor of Information Technology",
      "description": "This course introduces learners to the concepts of program design and programming fundamentals. By the end of the course, learners will be able to create programs using basic programming constructs and simple data structures to solve specified problems, and apply a logic depiction method to decompose appropriate simple problems. Topics include program design, algorithms, structured diagrams (UML), if statements, nested ifs, switch statements, loops, arrays, data types and records, reading files of records, text files, and version control."
    },
    {
      "course_title": "Programming 2",
      "sms_code": "ID511001 / IA511001",
      "year": 1,
      "credits": 15,
      "prerequisites": [
        "ID510001"
      ],
      "directed_learning_hours": 60,
      "workplace_learning_hours": 0,
      "self_directed_learning_hours": 90,
      "total_learning_hours": 150,
      "program": "Bachelor of Information Technology",
      "description": "This course enables learners to build simple object-oriented (OO) applications and identify situations most appropriate for OO implementation. By the end of the course, learners will be able to build interactive, event-driven GUI applications using pre-built components, and declare and implement user-defined classes using encapsulation, inheritance, and polymorphism. Topics include problem analysis and decomposition, principles of good class design, logic of basic algorithms, use of core complex data structures, and good programming practices that are independent of the language or model used."
    },
    {
    "course_title": "Fundamentals of Web Development",
    "sms_code": "ID512002 / IA512002",
    "year": 1,
    "credits": 15,
    "prerequisites": [
      "ID510001"
    ],
    "directed_learning_hours": 60,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 90,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course enables learners to use basic technologies for the development of web-based functionality. By the end of the course, learners will be able to develop simple web-based applications using industry relevant client/server-side programming languages and basic client/server communication, and use industry relevant tools and workflows in the development of web-based applications. Topics include web communication (client/server relationship), HTML, CSS, JavaScript, libraries/frameworks, responsive design, APIs, and basic deployment."
  },
  {
    "course_title": "Introduction to Networks",
    "sms_code": "ID515001 / IA515001",
    "year": 1,
    "credits": 15,
    "prerequisites": [
      "None"
    ],
    "directed_learning_hours": 60,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 90,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course introduces learners to fundamental networking concepts and technologies, covering the basics of network theory and skills needed to implement a simple network. By the end of the course, learners will be able to design and build a simple local area network using device addressing schemes and basic network configurations, and configure and troubleshoot end-to-end connectivity between local and remote networks using security best practices. Topics include the OSI model, types of networks, application layer functionality, transport layer protocols (TCP/UDP), network layer protocols (IPv4), layer 3 addressing and subnetting, data link layer concepts and addressing, network cabling, and configuring and testing a network."
  },
  {
    "course_title": "Platforms and Devices",
    "sms_code": "ID520003 / IA520003",
    "year": 1,
    "credits": 15,
    "prerequisites": [
      "None"
    ],
    "directed_learning_hours": 60,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 90,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course enables learners to use a range of devices, platforms and concepts utilised within the IT industry. By the end of the course, learners will be able to install and configure operating systems on devices for functionality and network connectivity, select and apply systems tools, command line and scripting to configure, maintain, and secure operating systems in local and virtual settings, and troubleshoot hardware and operating system faults for the main components of a computer. Topics include installing, configuring, and selecting PC hardware components, operating systems installation and maintenance, overview of operating systems (mobile, desktop, server), virtualisation, transmission protocols (e.g., FTP, SSH), file systems, backup and RAID systems, troubleshooting hardware and software, connecting and configuring devices (Bluetooth, Wi-Fi, printers, etc.), mounting drives, command line proficiency, basic network configuration, embedded systems (Raspberry Pi, Arduino), environmental impact of IT, and sustainability issues in purchasing, using, and disposing of devices."
  },
  {
    "course_title": "Maths for IT",
    "sms_code": "ID521001 / IA521001",
    "year": 1,
    "credits": 15,
    "prerequisites": [
      "None"
    ],
    "directed_learning_hours": 60,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 90,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course introduces learners to mathematical concepts and methods that underpin computer systems, primarily within the field of discrete mathematics. By the end of the course, learners will be able to use the mathematical structures and algorithms that underpin digital systems, and apply mathematical methods to solve problems in an Information Technology context. Topics include logic circuits, decimal and binary number systems, vectors and matrices, randomness and probability, factorials, permutations and combinations, check digits, random number generation, encryption, algorithms, iteration, recursion, hash tables and hash functions, and computational complexity."
  },
  {
    "course_title": "Year One Special Topic",
    "sms_code": "ID530151 / IA530151",
    "year": 1,
    "credits": 15,
    "prerequisites": [
      "None"
    ],
    "directed_learning_hours": 30,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 120,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course allows learners to pursue an individual course of study focused in depth on a specific aspect of Information Technology. By the end of the course, learners will be able to analyse a specific topic whilst applying the underlying principles and concepts to the field of study. The process may include producing a proposal identifying the purpose, scope, required skills and knowledge, and learning and assessment plan; carrying out the special topic work; compiling a work log or progress report; reviewing progress with a supervisor; and presenting assessment material or a final report."
  },
  {
    "course_title": "Studio 3",
    "sms_code": "ID606001 / IA606001",
    "year": 2,
    "credits": 15,
    "prerequisites": [
      "ID503001 / IA503001"
    ],
    "directed_learning_hours": 60,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 90,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course enables learners to use an industry-relevant project management approach to produce simple, functional group outputs. By the end of the course, learners will be able to analyse user requirements to inform technical project work and produce user-centric functionality, and employ ethical and sustainable development methodologies and tools in a team environment. Topics include iterative design thinking strategies, user-driven development, modern team collaboration and development frameworks, sound communication and project management strategies, and producing high-quality technical outputs."
  },
  {
    "course_title": "Studio 4",
    "sms_code": "ID622001 / IA622001",
    "year": 2,
    "credits": 15,
    "prerequisites": [
      "ID606001"
    ],
    "directed_learning_hours": 60,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 90,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course focuses on producing a professional, high-quality group project adhering to industry-relevant quality assurance and ethical practices. By the end of the course, learners will be able to select and apply industry-standard tools and processes to solve non-trivial problems in a team environment, and analyse and manage development challenges to create production-quality outputs. Topics include security, privacy, quality, user experience, deployment, modern quality assurance practices, appropriate use of automation, and efficient cross-discipline teamwork."
  },
  {
    "course_title": "Databases 2",
    "sms_code": "ID605001 / IA605001",
    "year": 2,
    "credits": 15,
    "prerequisites": [
      "IN505001",
      "IN511001"
    ],
    "directed_learning_hours": 60,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 90,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course provides an understanding of the fundamentals of database management systems, with emphasis on relational systems. By the end of the course, learners will be able to plan and build a normalised relational database to solve a specified problem, and use syntactically correct SQL to write database queries that ensure data integrity. Topics include the role of relational databases and relational database management systems, relational algebra, functional dependencies, normalisation, RDBMS architecture, query construction and optimisation, data modelling, design and implementation of relational databases, and principles of database administration and security."
  },
  {
    "course_title": "Introductory Application Development Concepts",
    "sms_code": "ID607001 / IA607001",
    "year": 2,
    "credits": 15,
    "prerequisites": [
      "IN511001"
    ],
    "directed_learning_hours": 60,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 90,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course introduces the concepts of application development, including algorithms, data structures, and design patterns required to use a simple, industry-relevant development framework. By the end of the course, learners will be able to design and build secure applications with dynamic database functionality following an appropriate software development methodology. Topics include server and client-side programming, design patterns such as MVC, database integration (ORMs), database migration, automated testing, and session-based authentication."
  },
  {
    "course_title": "Intermediate Application Development Concepts",
    "sms_code": "ID608001 / IA608001",
    "year": 2,
    "credits": 15,
    "prerequisites": [
      "ID607001"
    ],
    "directed_learning_hours": 60,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 90,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course extends the concepts of application development, including algorithms, data structures, and design patterns, required to use complex, industry-relevant frameworks or libraries. By the end of the course, learners will be able to apply design patterns and programming principles using software development best practices, and design and implement full-stack applications using industry-relevant programming languages. Topics include APIs, database integration, deployment, design patterns, frameworks or libraries, ORMs, session-based authentication, automated testing, security, and parallelism."
  },
  {
    "course_title": "Switching, Routing and Wireless Essentials",
    "sms_code": "ID615008 / IA615008",
    "year": 2,
    "credits": 15,
    "prerequisites": [
      "IN515001"
    ],
    "directed_learning_hours": 60,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 90,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course enables learners to apply knowledge of router and switch operation, network architecture, and services to configure small-to-medium business networks. By the end of the course, learners will be able to design and build a network for availability and redundancy, and configure and troubleshoot flexible local area networks using virtual and wireless technologies. Topics include basic and enhanced switching concepts, VLANs, VTP, RSTP, PVSTP, 802.1q, router operations, static and dynamic routing, ACLs, DHCP, wireless LAN concepts, and LAN security."
  },
  {
    "course_title": "Operating Systems Concepts",
    "sms_code": "ID616001 / IA616001",
    "year": 2,
    "credits": 15,
    "prerequisites": [
      "IN510001",
      "IN520002"
    ],
    "directed_learning_hours": 60,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 90,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course introduces the basic mechanisms of an operating system and its management among various components, laying a foundation for advanced system administration, virtualization, and security. By the end of the course, learners will be able to perform automated user and permissions management in a computing system, analyse and manage process, memory, storage, and network management modules, and evaluate the design and process models of contemporary operating systems. Topics include OS concepts, OS design, Linux shell commands, kernel customization, process/thread management, services and daemons, bash scripting, system administration tasks, file systems, and networking with Linux systems."
  },
  {
    "course_title": "Operations Engineering 1",
    "sms_code": "ID609001 / IA609001",
    "year": 2,
    "credits": 15,
    "prerequisites": [
      "ID616001"
    ],
    "directed_learning_hours": 60,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 90,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course provides learners with knowledge and hands-on skills to perform system administration tasks securely across different computing platforms using the command line interface. By the end of the course, learners will be able to identify key tools and services for administering computing systems, develop advanced shell scripts to automate administration tasks, and use cloud and directory services for enterprise infrastructure. Topics include network and firewall configuration, advanced user/group management, advanced scripting, ticketing, backup and disaster recovery, directory services, cloud services deployment, OS and network hardening, and containers."
  },
  {
    "course_title": "Embedded Systems",
    "sms_code": "ID620001 / IA620001",
    "year": 2,
    "credits": 15,
    "prerequisites": [
      "IN520002"
    ],
    "directed_learning_hours": 60,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 90,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course introduces the core principles of computer hardware and architecture and acquaints learners with a range of embedded application contexts. It is not intended to teach CPU design or assembler programming. By the end of the course, learners will be able to analyse the parameters of a problem domain that can be solved with an embedded systems solution and implement a complete embedded systems solution to meet requirements. Topics include low-level hardware, instruction processing, CPU design principles, high-level architecture, embedded application areas, theory and principles of control systems, embedded system hardware and software, and project work."
  },
  {
    "course_title": "Automation and Robotics",
    "sms_code": "ID621001 / IA621001",
    "year": 2,
    "credits": 15,
    "prerequisites": [
      "ID620001"
    ],
    "directed_learning_hours": 60,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 90,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course extends and refines micro-electronics skills to build physically and behaviourally complex, highly interactive artefacts. By the end of the course, learners will be able to apply core electronic and mechanical principles to robotics/automated systems design, design solutions following interaction design principles, and use appropriate development platforms to implement simple interactive robotics/automated systems. Topics include historical development of automated systems, application areas, robotics simulation, sensors, hardware for robotics/automated systems, development software, interaction design principles, and project-based design and construction."
  },
  {
    "course_title": "Introductory Game Development",
    "sms_code": "ID623001",
    "year": 2,
    "credits": 15,
    "prerequisites": [
      "IN/ID511001: Programming 2"
    ],
    "directed_learning_hours": 48,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 102,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course introduces the concepts of game development, including algorithms and data structures required to use a simple, industry-relevant framework. By the end of the course, learners will be able to design and build usable games using various introductory algorithms, following an appropriate software development methodology. Topics include Unity scripting, game mechanics, maze generation, and AI strategy."
  },
  {
    "course_title": "Year Two Special Topic",
    "sms_code": "ID630151 / IA630151",
    "year": 2,
    "credits": 15,
    "prerequisites": [
      "120 credits at Level 5"
    ],
    "directed_learning_hours": 30,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 120,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course allows learners to carry out semi-independent exploration of a specific IT topic not covered by existing courses. Learners will negotiate objectives, a learning plan, assessment criteria, and time frames with a supervising lecturer. By the end of the course, learners will be able to examine and discuss a specific topic while applying underlying principles and concepts to the field of study. Content includes independent research using academic journals, textbooks, and credible online resources, with theoretical material and applied skills development supported by a staff supervisor."
  },
  {
    "course_title": "Studio 5",
    "sms_code": "ID728001 / IA728001",
    "year": 3,
    "credits": 15,
    "prerequisites": [
      "ID622001"
    ],
    "directed_learning_hours": 15,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 135,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course enables learners to apply technical skills within complex IT projects and extend professional behaviour through group work, professional development activities, and external engagement. By the end of the course, learners will be able to analyse real-world problems to create IT systems, apply technical and theoretical skills to complex situations, and contribute as part of a structured development team. Learners complete large, real client-driven projects under supervision."
  },
  {
    "course_title": "Studio 6",
    "sms_code": "ID732001",
    "year": 3,
    "credits": 15,
    "prerequisites": [
      "ID728001"
    ],
    "directed_learning_hours": 15,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 135,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course enables learners to extend their skills within a complex IT project. By the end of the course, learners will be able to critically evaluate and apply processes to unfamiliar and complex problems, engage in advanced study in specialist areas, and demonstrate leadership within a project group. Learners complete the development of large, real client-driven projects under supervision."
  },
  {
    "course_title": "Developing Flexible IT Courses",
    "sms_code": "ID703001",
    "year": 3,
    "credits": 15,
    "prerequisites": [
      "IN502001"
    ],
    "directed_learning_hours": 60,
    "workplace_learning_hours": 0,
    "self_directed_learning_hours": 90,
    "total_learning_hours": 150,
    "program": "Bachelor of Information Technology",
    "description": "This course prepares learners for the training role often undertaken by IT professionals. By the end of the course, learners will be able to design, create, implement, and evaluate a computer-based tutorial to teach technical skills or knowledge to a specified audience, and design, conduct, and evaluate a blended IT training programme, including Treaty of Waitangi considerations. Topics include evaluating training materials, screen recording software, interactive quizzes, tutorial writing, learning tools, learning styles, training needs analysis, training methods, conducting sessions, evaluation, computer-based training, and interactive facilitation."
  },
  
  ]
}
